{
  "title": "The Influence of Family Leadership on Girl- Child School Dropout",
  "type": "journal",
  "authors": [
    {
      "first_name": "Angelina",
      "last_name": "Shoo"
    },
    {
      "first_name": "Chrispina",
      "last_name": "Lekule"
    }
  ],
  "year": 2021,
  "source": "East African Journal of Education Studies",
  "identifiers": {
    "issn": "2707-3939",
    "doi": "10.37284/eajes.4.1.455"
  },
  "pages": "61-73",
  "volume": "4",
  "issue": "1",
  "month": 11,
  "publisher": "East African Nature and Science Organization",
  "day": 3,
  "id": "24ffab34-1475-3f21-be54-f732747789fb",
  "created": "2025-05-05T08:40:06.428Z",
  "file_attached": true,
  "profile_id": "b0f9888c-7f82-33e4-a2f0-6560a3165df3",
  "last_modified": "2025-05-05T08:40:06.428Z",
  "abstract": "Family leadership is one of the vital aspects that influences and determines both the wellbeing and successful education of a girl-child. Unfortunately, the role of family leadership in ensuring girls' education is oversimplified into getting girls enrolled in school rather than warranting their perseverance in learning and successful completion. As a result, many communities in Tanzania, especially those in rural and marginalized areas are experiencing persistent girl–child school dropouts. It is against this standpoint that we sought to find out how family leadership may influence secondary school girls’ dropouts. We also explored possible measures which should be employed to eliminate girl-child school dropouts. In conducting this study, we employed a mixed research approach and convergent parallel design. We collected data through interviews and questionnaires involving 143 respondents including girl students, teachers, heads of schools, and district educational officers. Our findings from this study indicate that while the government of Tanzania has made remarkable efforts to ensure girls’ continuity and successful completion of secondary education, there are a number of factors hindering girls’ continuity and completion of secondary education. Weak family leadership, the improper raising of the children, less emphasis and interest on the importance of girls’ education, limited cooperation between family leadership were among the reason for continuous girl-child school dropout. Hence, based on our findings and the significance of girl’s education as well as the role which parents should play in ensuring girls achievement of education, we appeal to various educational leaders, to make strategic efforts in raising more awareness among rural and marginalized communities about the importance of educating girls and the role of family leadership in bringing to an end the phenomena of girl-child school dropout which is catastrophic to the long-awaited sustainable development. Moreover, we call upon all parents, to make intentional efforts in mentoring and influencing girls to strive towards achieving formal education."
}