[
  {
    "title": "Early marriage, pregnancy and girl child school dropout",
    "type": "journal",
    "authors": [
      {
        "first_name": "Jenny",
        "last_name": "Birchall"
      }
    ],
    "year": 2018,
    "source": "Knowledge, evidence and learning for development",
    "id": "525c6397-0fe4-3a0a-abf9-0ba54fe223fc",
    "created": "2025-03-04T02:12:11.208Z",
    "profile_id": "b0f9888c-7f82-33e4-a2f0-6560a3165df3",
    "last_modified": "2025-03-04T04:27:43.988Z",
    "abstract": "Birchall, J. (2018). Early marriage, pregnancy and girl child school dropout. K4D Helpdesk Report. The aim of this review was to present the recent evidence on the impact of early marriage and/or pregnancy on the rates of girl child drop out. It also synthesises evidence that focus on laws, policies and practices that force pregnant girls or new mothers out of school. Although early marriage and pregnancy are often linked to school dropout, evidence proving a direct and causal link is limited. This is because early marriage and pregnancy can be both the cause and consequence of dropping out of school. Girls certainly leave or are taken out of school because they are pregnant or married, but girls who have already dropped out of school are more likely to marry and/or become pregnant. There is a significant body of evidence looking at the links between early pregnancy (often outside of marriage) and school dropout in Sub-Saharan Africa, and there are some studies that consider the relationship between early marriage (and resulting early pregnancies) and school drop out in South Asia. While it is clear that early pregnancy and marriage play an important part in girl child school dropout, the different perimeters of available studies, combined with a lack of robust, comparable national data, and the fact that early marriage and pregnancy, as well as school dropout, are so interlinked with socioeconomic inequalities and unequal gender norms, means it is difficult to make simple causal assumptions about exactly how early marriage and pregnancy influence school dropout."
  },
  {
    "title": "The Influence of Family Leadership on Girl- Child School Dropout",
    "type": "journal",
    "authors": [
      {
        "first_name": "Angelina",
        "last_name": "Shoo"
      },
      {
        "first_name": "Chrispina",
        "last_name": "Lekule"
      }
    ],
    "year": 2021,
    "source": "East African Journal of Education Studies",
    "identifiers": {
      "doi": "10.37284/eajes.4.1.455",
      "issn": "2707-3939"
    },
    "id": "e3dc6c1e-2345-3915-bc3d-ecf25c1dc4c1",
    "created": "2025-03-04T02:12:19.397Z",
    "profile_id": "b0f9888c-7f82-33e4-a2f0-6560a3165df3",
    "last_modified": "2025-03-04T04:57:15.125Z",
    "abstract": "Family leadership is one of the vital aspects that influences and determines both the wellbeing and successful education of a girl-child. Unfortunately, the role of family leadership in ensuring girls' education is oversimplified into getting girls enrolled in school rather than warranting their perseverance in learning and successful completion. As a result, many communities in Tanzania, especially those in rural and marginalized areas are experiencing persistent girl–child school dropouts. It is against this standpoint that we sought to find out how family leadership may influence secondary school girls’ dropouts. We also explored possible measures which should be employed to eliminate girl-child school dropouts. In conducting this study, we employed a mixed research approach and convergent parallel design. We collected data through interviews and questionnaires involving 143 respondents including girl students, teachers, heads of schools, and district educational officers. Our findings from this study indicate that while the government of Tanzania has made remarkable efforts to ensure girls’ continuity and successful completion of secondary education, there are a number of factors hindering girls’ continuity and completion of secondary education. Weak family leadership, the improper raising of the children, less emphasis and interest on the importance of girls’ education, limited cooperation between family leadership were among the reason for continuous girl-child school dropout. Hence, based on our findings and the significance of girl’s education as well as the role which parents should play in ensuring girls achievement of education, we appeal to various educational leaders, to make strategic efforts in raising more awareness among rural and marginalized communities about the importance of educating girls and the role of family leadership in bringing to an end the phenomena of girl-child school dropout which is catastrophic to the long-awaited sustainable development. Moreover, we call upon all parents, to make intentional efforts in mentoring and influencing girls to strive towards achieving formal education."
  },
  {
    "title": "The Influence of Family Leadership on Girl- Child School Dropout",
    "type": "journal",
    "authors": [
      {
        "first_name": "Mary Wambui",
        "last_name": "Kamau"
      },
      {
        "first_name": "Simon",
        "last_name": "Nyakwara"
      }
    ],
    "year": 2021,
    "source": "East African Journal of Interdisciplinary Studies",
    "identifiers": {
      "doi": "10.37284/eajis.4.1.454",
      "issn": "2707-529X"
    },
    "id": "bcd047f1-b84c-319f-a032-e8d81b602b75",
    "created": "2025-03-04T02:13:07.428Z",
    "profile_id": "b0f9888c-7f82-33e4-a2f0-6560a3165df3",
    "last_modified": "2025-03-04T04:56:02.526Z",
    "abstract": "Family leadership is one of the vital aspects that influences and determines both the wellbeing and successful education of a girl-child. Unfortunately, the role of family leadership in ensuring girls' education is oversimplified into getting girls enrolled in school rather than warranting their perseverance in learning and successful completion. As a result, many communities in Tanzania, especially those in rural and marginalized areas are experiencing persistent girl–child school dropouts. It is against this standpoint that we sought to find out how family leadership may influence secondary school girls’ dropouts. We also explored possible measures which should be employed to eliminate girl-child school dropouts. In conducting this study, we employed a mixed research approach and convergent parallel design. We collected data through interviews and questionnaires involving 143 respondents including girl students, teachers, heads of schools, and district educational officers. Our findings from this study indicate that while the government of Tanzania has made remarkable efforts to ensure girls’ continuity and successful completion of secondary education, there are a number of factors hindering girls’ continuity and completion of secondary education. Weak family leadership, the improper raising of the children, less emphasis and interest on the importance of girls’ education, limited cooperation between family leadership were among the reason for continuous girl-child school dropout. Hence, based on our findings and the significance of girl’s education as well as the role which parents should play in ensuring girls achievement of education, we appeal to various educational leaders, to make strategic efforts in raising more awareness among rural and marginalized communities about the importance of educating girls and the role of family leadership in bringing to an end the phenomena of girl-child school dropout which is catastrophic to the long-awaited sustainable development. Moreover, we call upon all parents, to make intentional efforts in mentoring and influencing girls to strive towards achieving formal education"
  },
  {
    "title": "The effect of parental job loss on child school dropout: Evidence from the Occupied Palestinian Territories",
    "type": "journal",
    "authors": [
      {
        "first_name": "Michele",
        "last_name": "Di Maio"
      },
      {
        "first_name": "Roberto",
        "last_name": "Nisticò"
      }
    ],
    "year": 2019,
    "source": "Journal of Development Economics",
    "identifiers": {
      "doi": "10.1016/j.jdeveco.2019.102375",
      "pui": "2002740512",
      "scopus": "2-s2.0-85071444728",
      "sgr": "85071444728",
      "issn": "03043878"
    },
    "id": "b5b8f90f-df12-3e65-a26f-0d223c6bb699",
    "created": "2025-03-04T02:14:02.646Z",
    "profile_id": "b0f9888c-7f82-33e4-a2f0-6560a3165df3",
    "last_modified": "2025-03-04T04:55:38.728Z",
    "abstract": "We study the effect of parental job loss on child school dropout in developing countries. We focus on Palestinian households living in the Occupied Palestinian Territories and having the household head employed in Israel during the Second Intifada (2000–2006). We exploit quarterly variation in conflict intensity across districts in the OPT to instrument for Palestinian workers’ job loss in Israel. Our 2SLS results show that parental job loss increases child school dropout probability by 9 percentage points. The effect varies with child and household characteristics. We provide evidence that the effect operates through the job loss-induced reduction in household income."
  },
  {
    "title": "The Influence of Family Leadership on Girl- Child School Dropout",
    "type": "journal",
    "authors": [
      {
        "first_name": "Angelina",
        "last_name": "Shoo"
      },
      {
        "first_name": "Chrispina",
        "last_name": "Lekule"
      }
    ],
    "year": 2021,
    "source": "East African Journal of Education Studies",
    "identifiers": {
      "doi": "10.37284/eajes.4.1.455",
      "issn": "2707-3939"
    },
    "id": "897b5ec3-e5bc-3357-bdaa-a3f6e75bca3d",
    "created": "2025-05-05T08:28:14.699Z",
    "profile_id": "b0f9888c-7f82-33e4-a2f0-6560a3165df3",
    "last_modified": "2025-05-05T08:28:15.110Z",
    "abstract": "Family leadership is one of the vital aspects that influences and determines both the wellbeing and successful education of a girl-child. Unfortunately, the role of family leadership in ensuring girls' education is oversimplified into getting girls enrolled in school rather than warranting their perseverance in learning and successful completion. As a result, many communities in Tanzania, especially those in rural and marginalized areas are experiencing persistent girl–child school dropouts. It is against this standpoint that we sought to find out how family leadership may influence secondary school girls’ dropouts. We also explored possible measures which should be employed to eliminate girl-child school dropouts. In conducting this study, we employed a mixed research approach and convergent parallel design. We collected data through interviews and questionnaires involving 143 respondents including girl students, teachers, heads of schools, and district educational officers. Our findings from this study indicate that while the government of Tanzania has made remarkable efforts to ensure girls’ continuity and successful completion of secondary education, there are a number of factors hindering girls’ continuity and completion of secondary education. Weak family leadership, the improper raising of the children, less emphasis and interest on the importance of girls’ education, limited cooperation between family leadership were among the reason for continuous girl-child school dropout. Hence, based on our findings and the significance of girl’s education as well as the role which parents should play in ensuring girls achievement of education, we appeal to various educational leaders, to make strategic efforts in raising more awareness among rural and marginalized communities about the importance of educating girls and the role of family leadership in bringing to an end the phenomena of girl-child school dropout which is catastrophic to the long-awaited sustainable development. Moreover, we call upon all parents, to make intentional efforts in mentoring and influencing girls to strive towards achieving formal education."
  }
]